{

  "companyName": "Google",
  "position": "Software Engineer",
  "signature": "Bradley",
  "roles": [
    { "name": "would make me an excellent addition to your team as a"},
    { "name": "make me a strong candidate for the opening of"},
    { "name": "make me a well qualified candidate for the position of"}
  ],
  "bodies": [
    { "name": ""},
    { "name": "For the past ten years, including five at Google, I have been exposed to a wide range of technologies."},
    { "name": "A little about myself, I have roughly 10 years of software engineering experience, including 5 at Google."},
    { "name": "Over the past ten years, including stints at Google and in the agency world, I have been exposed to a wide range of technologies."},
    { "name": "In particular and most relevant to this position includes several Javascript frotend projects."},
    { "name": "A short list of tools and technology I have some professional experience with are Javascript (frontend/backend), HTML/CSS, C/C++, Python, Java (Android), Linux, BASH, Nginx, Apache, Docker, Jenkins, JIRA and many others that I at least experimented with."},
    { "name": "Most recently, I laid out the architecture for an Angular/Django REST app for running dental practices."}
  ],
  "skills": [
    { "name": "diverse technical background"},
    { "name": "attention to detail"},
    { "name": "great communication skills"},
    { "name": "frontend/fullstack experience"},
    { "name": "desire to wear many hats"}, 
    { "name": "desire to change the world"}
  ],
  "particulars": [
    { "name": "Experience with source control systems (Perforce, Subversion, Git)"},
    { "name": "Experience with Linux"},
    { "name": "Android app development"},
    { "name": "Frontend developments skills (vanillajs, Angular, Angular2, React)"},
    { "name": "Python development (Django, Flask)"}
  ],
  "closers": [
  { "name": ""},
  { "name": "Find attached a copy of my resume in PDF format, and I look forward to hearing from you soon."},
  { "name": "If you think I could be a good match for the position or any others you are aware of, I would love to schedule a phone call and discuss it further."}
  ],
  "closings": [
    { "name": "Thank you for your time and consideration."},
    { "name": "Sincerely,"},
    { "name": "Regards,"},
    { "name": "Best,"},
    { "name": "Cheers,"}
  ]
}

